In [3]:
# A library for data manipulation and analysis.
# Notebook based off of Python Data Science Handbook by Jake VanderPlas.

In [2]:
import pandas as pd

The three data structures to know:
- Series
- DataFrame
- Index

In [3]:
# Series is a structure that maps keys to typed values
data = {
    'Balloons': 50,
    'Cake': 1,
    'Attendees': 20,
    'Clowns': 0,
    'Stressed Out Parents': 2,
}
series = pd.Series(data)
series

Attendees               20
Balloons                50
Cake                     1
Clowns                   0
Stressed Out Parents     2
dtype: int64

In [4]:
series['Attendees']  # dict like indexing

20

In [5]:
series['Attendees':'Clowns']  # list like slicing 
# (NB! Includes ending index 'Clowns' since explicit index was used)

Attendees    20
Balloons     50
Cake          1
Clowns        0
dtype: int64

In [6]:
series.index  # "keys" for each row

Index(['Attendees', 'Balloons', 'Cake', 'Clowns', 'Stressed Out Parents'], dtype='object')

In [7]:
# Can create index manually
index = pd.Index(['Attendees', 'Balloons', 'Cake', 'Clowns', 'Stressed Out Parents'])
index

Index(['Attendees', 'Balloons', 'Cake', 'Clowns', 'Stressed Out Parents'], dtype='object')

In [8]:
# DataFrame is sequence of aligned series objects.
# Aligned == They share the same index
data = {
    '2015': [30, 40, 1, 1, 2],
    '2016': [20, 50, 1, 0, 2],
    '2017': [30, 50, 1, 0, 2],
}
df = pd.DataFrame(
    data,
    index=index
)
df

                      2015  2016  2017
Attendees               30    20    30
Balloons                40    50    50
Cake                     1     1     1
Clowns                   1     0     0
Stressed Out Parents     2     2     2

In [9]:
df.index

Index(['Attendees', 'Balloons', 'Cake', 'Clowns', 'Stressed Out Parents'], dtype='object')

In [10]:
df.columns

Index(['2015', '2016', '2017'], dtype='object')

In [11]:
df['2015']  # Get a column by indexing like usual

30

In [12]:
df.loc['Attendees']  # Get a row by name using the .loc method (explicit index)

2015    30
2016    20
2017    30
Name: Attendees, dtype: int64

In [13]:
df.iloc[0]  # Get a row by integer index using the .iloc method (implicit index)

2015    30
2016    20
2017    30
Name: Attendees, dtype: int64

In [14]:
# More values passed to method are used to 
# index into deeper dimensions. 
df.loc['Attendees', '2015']

30

In [15]:
df['2015']  # Indexing refers to columns

Attendees               30
Balloons                40
Cake                     1
Clowns                   1
Stressed Out Parents     2
Name: 2015, dtype: int64

In [16]:
df['Attendees':'Cake']  # Slice effects rows

           2015  2016  2017
Attendees    30    20    30
Balloons     40    50    50
Cake          1     1     1

In [17]:
# Great way to think of a index: a powerful tuple.
# It can't change, but it can do super fast lookups and set operations.
df.index[0] = 1  # can't change

TypeError: Index does not support mutable operations

In [18]:
df.index ^ {'Attendees'}  # Set operations

Index(['Balloons', 'Cake', 'Clowns', 'Stressed Out Parents'], dtype='object')

In [19]:
# Comparison of column with integer will return boolean series
df['2015'] > 30

Attendees               False
Balloons                 True
Cake                    False
Clowns                  False
Stressed Out Parents    False
Name: 2015, dtype: bool

In [20]:
df[df['2015'] > 30]  # Series can be used to filter rows!

          2015  2016  2017
Balloons    40    50    50

In [21]:
# Convert DataFrame to a Series with a hierarchical index.
multi_df = df.stack()
multi_df

Attendees             2015    30
                      2016    20
                      2017    30
Balloons              2015    40
                      2016    50
                      2017    50
Cake                  2015     1
                      2016     1
                      2017     1
Clowns                2015     1
                      2016     0
                      2017     0
Stressed Out Parents  2015     2
                      2016     2
                      2017     2
dtype: int64

In [22]:
multi_df['Attendees', '2015']  # Index using multiple items

30

In [23]:
multi_df.loc['Attendees', '2015':'2018']  # And some slicing

Attendees  2015    30
           2016    20
           2017    30
dtype: int64

In [26]:
# Get avg for each category
multi_df.mean(level=0)  # Level specifies dimension

Attendees               26.666667
Balloons                46.666667
Cake                     1.000000
Clowns                   0.333333
Stressed Out Parents     2.000000
dtype: float64

In [27]:
flat_df = multi_df.reset_index()  # Break down index into columns
flat_df

                 level_0 level_1   0
0              Attendees    2015  30
1              Attendees    2016  20
2              Attendees    2017  30
3               Balloons    2015  40
4               Balloons    2016  50
5               Balloons    2017  50
6                   Cake    2015   1
7                   Cake    2016   1
8                   Cake    2017   1
9                 Clowns    2015   1
10                Clowns    2016   0
11                Clowns    2017   0
12  Stressed Out Parents    2015   2
13  Stressed Out Parents    2016   2
14  Stressed Out Parents    2017   2

In [28]:
flat_df.set_index(['level_0', 'level_1'])  # Rebuild hierarchical index

                               0
level_0              level_1
Attendees            2015     30
                     2016     20
                     2017     30
Balloons             2015     40
                     2016     50
                     2017     50
Cake                 2015      1
                     2016      1
                     2017      1
Clowns               2015      1
                     2016      0
                     2017      0
Stressed Out Parents 2015      2
                     2016      2
                     2017      2

In [29]:
import numpy as np

rng = np.random.RandomState(42)

In [30]:
rng.randint(0, 10, 3)

array([6, 3, 7])

In [31]:
df = pd.DataFrame(
    rng.randint(0, 10, (3, 4)),
    columns=['A', 'B', 'C', 'D'],
)
df

   A  B  C  D
0  4  6  9  2
1  6  7  4  3
2  7  7  2  5

In [32]:
df2 = pd.DataFrame(
    rng.randint(0, 10, (3, 4)),
    columns=['B', 'C', 'D', 'E'],
)
df2

   B  C  D  E
0  4  1  7  5
1  1  4  0  9
2  5  8  0  9

In [33]:
# pandas will attempt to align indicies when performing most 
# arithmetic operations. Undefined operations will produce NaN.
df + df2

    A   B   C  D   E
0 NaN  10  10  9 NaN
1 NaN   8   8  3 NaN
2 NaN  12  10  5 NaN

In [34]:
np.nan + 1  # FYI: NaN + anything == NaN

nan

In [35]:
(df + df2).dropna(axis=1)  # Drop any column with NaN

    B   C  D
0  10  10  9
1   8   8  3
2  12  10  5

In [36]:
(df + df2).fillna(0)

     A   B   C  D    E
0  0.0  10  10  9  0.0
1  0.0   8   8  3  0.0
2  0.0  12  10  5  0.0

In [37]:
# Just sticking them together?
pd.concat([df, df2])

     A  B  C  D    E
0  4.0  6  9  2  NaN
1  6.0  7  4  3  NaN
2  7.0  7  2  5  NaN
0  NaN  4  1  7  5.0
1  NaN  1  4  0  9.0
2  NaN  5  8  0  9.0

In [38]:
df.append(df2)  # Same as pd.concat but 6 characters shorter

     A  B  C  D    E
0  4.0  6  9  2  NaN
1  6.0  7  4  3  NaN
2  7.0  7  2  5  NaN
0  NaN  4  1  7  5.0
1  NaN  1  4  0  9.0
2  NaN  5  8  0  9.0

In [39]:
df1 = pd.DataFrame({
    'name': ['Kanye West', 'Anderson Cooper', 'Ada Lovelace', 'Megan Smith'],
    'alias': ['Yeezus', 'Coop Dedupe', 'The Ace', 'US CTO'],
})

df2 = pd.DataFrame({
    'name': ['Kanye West', 'Anderson Cooper', 'Ada Lovelace', 'Megan Smith'],
    'birth_year': [1977, 1967, 1815, 1964],
    'skill': ['Rhymes', 'Looking Concentrated', 'Computer Science', 'Computer Science']
})

df3 = pd.merge(df1, df2)
df3

         alias             name  birth_year                 skill
0       Yeezus       Kanye West        1977                Rhymes
1  Coop Dedupe  Anderson Cooper        1967  Looking Concentrated
2      The Ace     Ada Lovelace        1815      Computer Science
3       US CTO      Megan Smith        1964      Computer Science

In [40]:
df4 = pd.DataFrame({
    'skill': ['Rhymes', 'Looking Concentrated', 'Computer Science'],
    'best_industry_for_skill': ['Music', 'News Media', 'Technology'],
})
df4

  best_industry_for_skill                 skill
0                   Music                Rhymes
1              News Media  Looking Concentrated
2              Technology      Computer Science

In [41]:
pd.merge(df3, df4)
# Automatically spreads best_industry_for_skill over new DataFrame!

,alias,name,birth_year,skill,best_industry_for_skill
0,Yeezus,Kanye West,1977,Rhymes,Music
1,Coop Dedupe,Anderson Cooper,1967,Looking Concentrated,News Media
2,The Ace,Ada Lovelace,1815,Computer Science,Technology
3,US CTO,Megan Smith,1964,Computer Science,Technology

#### Aggreation, filtering, transforming and applying functions

In [43]:
rng = np.random.RandomState(0)
df = pd.DataFrame({
    'animal': ['Alligator', 'Baboon', 'Cockatoo', 'Alligator', 'Baboon', 'Cockatoo'],
    'length': [2.7432, 0.762, 0.4572, 1.524, 0.801, 0.4307],  # meters
    'width': [0.613, 0.2703, 0.1043, 0.787, 0.3303, 0.2672],  # meters
    },
    columns=['animal', 'length', 'width'],
)
df

      animal  length   width
0  Alligator  2.7432  0.6130
1     Baboon  0.7620  0.2703
2   Cockatoo  0.4572  0.1043
3  Alligator  1.5240  0.7870
4     Baboon  0.8010  0.3303
5   Cockatoo  0.4307  0.2672

In [44]:
df.groupby(
    'animal'  # column whose values to group by
).aggregate(
    # List item for each aggregate function to run
    ['min', np.median, max, sum]
)

           length                            width
              min   median     max     sum     min   median     max     sum
animal
Alligator  1.5240  2.13360  2.7432  4.2672  0.6130  0.70000  0.7870  1.4000
Baboon     0.7620  0.78150  0.8010  1.5630  0.2703  0.30030  0.3303  0.6006
Cockatoo   0.4307  0.44395  0.4572  0.8879  0.1043  0.18575  0.2672  0.3715

In [45]:
# Alternatively, pass dict of column and aggregation on column
df.groupby('animal').aggregate({'length': 'min', 'width': 'max'})

           length   width
animal
Alligator  1.5240  0.7870
Baboon     0.7620  0.3303
Cockatoo   0.4307  0.2672

In [46]:
# Let's see the standard deviation for each key group
df.groupby('animal').std()

             length     width
animal
Alligator  0.862105  0.123037
Baboon     0.027577  0.042426
Cockatoo   0.018738  0.115188

In [47]:
def filter_func(x):
    # Only keep group with std deviation above 4.
    return x['width'].std() > 0.1

# Filter rows based on group's characteristics 
df.groupby('animal').filter(filter_func)

      animal  length   width
0  Alligator  2.7432  0.6130
2   Cockatoo  0.4572  0.1043
3  Alligator  1.5240  0.7870
5   Cockatoo  0.4307  0.2672

In [48]:
# Transform each row with group's characteristics
# NB. Called for each row!
def transform_func(group):
    return group - group.mean()
    
df.groupby('animal').transform(transform_func)

    length    width
0  0.60960 -0.08700
1 -0.01950 -0.03000
2  0.01325 -0.08145
3 -0.60960  0.08700
4  0.01950  0.03000
5 -0.01325  0.08145

In [50]:
# Apply function to each row!
# Called once for each group + 1
# https://github.com/pandas-dev/pandas/issues/2656#issuecomment-13365198
def norm_by_data2(group):
    group['length'] /= group['width'].sum()
    return group

df.groupby('animal').apply(norm_by_data2)

      animal    length   width
0  Alligator  1.959429  0.6130
1     Baboon  1.268731  0.2703
2   Cockatoo  1.230686  0.1043
3  Alligator  1.088571  0.7870
4     Baboon  1.333666  0.3303
5   Cockatoo  1.159354  0.2672

In [51]:
df2 = df.set_index('animal')
df2

           length   width
animal
Alligator  2.7432  0.6130
Baboon     0.7620  0.2703
Cockatoo   0.4572  0.1043
Alligator  1.5240  0.7870
Baboon     0.8010  0.3303
Cockatoo   0.4307  0.2672

In [52]:
# When given a function, groupby will apply function to index to get group
df2.groupby(str.lower).mean()

            length    width
alligator  2.13360  0.70000
baboon     0.78150  0.30030
cockatoo   0.44395  0.18575

#### Vectorize String Operations

In [53]:
bears = pd.Series((
    'Cheer Bear',
    'Share Bear',
    'Funshine Bear',
    'Grumpy Bear',
    'Tenderheart Bear',
    'Harmony Bear',
    'Wonderheart Bear',
    'Brave Heart Lion',
))
bears

0          Cheer Bear
1          Share Bear
2       Funshine Bear
3         Grumpy Bear
4    Tenderheart Bear
5        Harmony Bear
6    Wonderheart Bear
7    Brave Heart Lion
dtype: object

In [54]:
bears.str.lower()

0          cheer bear
1          share bear
2       funshine bear
3         grumpy bear
4    tenderheart bear
5        harmony bear
6    wonderheart bear
7    brave heart lion
dtype: object

In [55]:
bears.str.len()

0    10
1    10
2    13
3    11
4    16
5    12
6    16
7    16
dtype: int64

In [56]:
bears.str.startswith('C')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [57]:
# Get animal character type
bears.str.extract('(\w+)$', expand=True)

      0
0  Bear
1  Bear
2  Bear
3  Bear
4  Bear
5  Bear
6  Bear
7  Lion

#### Dates and Times!

In [58]:
date = np.array('2018-04-29', dtype=np.datetime64)
date

array('2018-04-29', dtype='datetime64[D]')

In [59]:
# NB. datetime64 is limited to 64 bit precision, thus we can represent 2^64 possible values.
# Trade of between precision and time span.

In [60]:
date + np.arange(10)  # cool datetime math

array(['2018-04-29', '2018-04-30', '2018-05-01', '2018-05-02',
       '2018-05-03', '2018-05-04', '2018-05-05', '2018-05-06',
       '2018-05-07', '2018-05-08'], dtype='datetime64[D]')

In [61]:
# Pandas can parse some complex datetimes
print(pd.to_datetime('2017-07-07 05:59'))
print(pd.to_datetime('07/07/2017 5:59 am'))
print(pd.to_datetime('2017/07/07 05:59 AM'))
print(pd.to_datetime('20170707 5:59a'))
print(pd.to_datetime('7th of July, 2017 5:59AM'))

2017-07-07 05:59:00
2017-07-07 05:59:00
2017-07-07 05:59:00
2017-07-07 05:59:00
2017-07-07 05:59:00

In [62]:
# Can parse out Timedelta's and ranges
pd.to_datetime('2017-07-07 05:59') + pd.to_timedelta('10 m')

Timestamp('2017-07-07 06:09:00')

In [63]:
# Quick and easy ranges
pd.date_range('2017-07-28', '2017-08-03')

DatetimeIndex(['2017-07-28', '2017-07-29', '2017-07-30', '2017-07-31',
               '2017-08-01', '2017-08-02', '2017-08-03'],
              dtype='datetime64[ns]', freq='D')

In [64]:
dates = pd.date_range('2017-07-01', periods=10, freq='M')
dates

DatetimeIndex(['2017-07-31', '2017-08-31', '2017-09-30', '2017-10-31',
               '2017-11-30', '2017-12-31', '2018-01-31', '2018-02-28',
               '2018-03-31', '2018-04-30'],
              dtype='datetime64[ns]', freq='M')

In [65]:
# DatetimeIndex can be used like any other index
pd.Series(rng.rand(len(dates)), index=dates)

2017-07-31    0.548814
2017-08-31    0.715189
2017-09-30    0.602763
2017-10-31    0.544883
2017-11-30    0.423655
2017-12-31    0.645894
2018-01-31    0.437587
2018-02-28    0.891773
2018-03-31    0.963663
2018-04-30    0.383442
Freq: M, dtype: float64